In [ ]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

### What you need to learn
- loading data
- selection
    - cols
    - rows
- manipulation
    - add column
    - remove columns
    - rename columns
    - change data type
    - delete data
    - remove duplicates
    - sort
    - group
    - pivot
    - merge
- visualization
    - line plot
    - bar plot
    - histogram
    - box plot
    - scatter plot
    - pie chart
    - heatmap
    - word cloud

In [ ]:
penguins = sns.load_dataset('penguins')
penguins

- analysis
    - univariate analysis
    - bi-variate analysis
    - multi-variate analysis

- loading data
    - custom data from a variable
    - excel data
    - csv/ json/ etc
    - database (sql)

In [ ]:
students = {
    'name':['Vaibhav', 'Siya', 'Aman','Amjad', 'Sneha','Aditi','Bhupendra'],
    'college':['SRMCEM', 'SRMCEM', "KMC", "KMC", 'CU','SRMCEM','SRMCEM'],
    'dob':['25 Jan','2 Feb','2 Apr', '16 Aug', '16 Sep','17 Dec','22 May']
}
sdf = pd.DataFrame(students)
sdf

In [ ]:
data = pd.read_excel('c:/users/zaid/Documents/example_dataset.xlsx')
data

In [ ]:
data.info()

In [ ]:
data.columns.tolist()

In [ ]:
data['Item'] # column selection as dictionary key

In [ ]:
data.amt # column selection as object attribute

In [ ]:
# data[collist]
data[['Item','amt']] # column selection as list of columns

operations between columns (numeric)

In [ ]:
data['amt'] * data['qty']

adding columns

In [ ]:
# data['new_col'] = expression
data['total'] = data['amt'] * data['qty']
data

In [ ]:
data['crap'] = 'some crap'
data

removing columns

In [24]:
data.drop(columns=['crap'], inplace=True) # inplace=True to make changes permanent in dataframe
data

     Item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500
2  Cherry  100  200  20000

In [26]:
data.iloc[0]

Item     Apple
qty        100
amt        100
total    10000
Name: 0, dtype: object

In [27]:
data.iloc[:2] # first two rows

     Item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500

In [32]:
data.drop(index=[2])

     Item  qty  amt  total
1  Banana   50   50   2500

In [31]:
data

     Item  qty  amt  total
0   Apple  100  100  10000
1  Banana   50   50   2500
2  Cherry  100  200  20000

In [34]:
sdf

        name college     dob
0    Vaibhav  SRMCEM  25 Jan
1       Siya  SRMCEM   2 Feb
2       Aman     KMC   2 Apr
3      Amjad     KMC  16 Aug
4      Sneha      CU  16 Sep
5      Aditi  SRMCEM  17 Dec
6  Bhupendra  SRMCEM  22 May

In [42]:
data['qty'] = data['qty'] - 10

In [43]:
data

     Item  qty  amt  total
0   Apple   90  100  10000
1  Banana   40   50   2500
2  Cherry   90  200  20000

In [45]:
data.columns.tolist()

['Item', 'qty', 'amt', 'total']

In [49]:
data.rename(
    mapper={'Item': 'product',
            'qty': 'quantity',
            'amt': 'Price',
            'total': 'Expenditure'},
    axis=1,
    inplace=True
)
data

  product  quantity  Price  Expenditure
0   Apple        90    100        10000
1  Banana        40     50         2500
2  Cherry        90    200        20000